Пансион83/src/Catalogs/ГруппыГостей/ГруппыГостей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыГостей</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Гостиницы</owners>
  <attributes>
    <name>Status</name>
    <type>
      <types>CatalogRef.СтатусРазмещения</types>
      <types>CatalogRef.СтатусБрони</types>
      <types>CatalogRef.СтатусБрониРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>Event</name>
    <type>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>OneCustomerPerGuestGroup</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Client</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ClientDoc</name>
    <type>
      <types>DocumentRef.Размещение</types>
      <types>DocumentRef.Бронирование</types>
      <types>DocumentRef.СчетПроживания</types>
      <types>DocumentRef.БроньУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>FixedClient</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CheckInDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CheckOutDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>GuestsCheckedIn</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Color</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>IsPending</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DateOfDef</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CheckDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExternalCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>CreateDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ReservationManager</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>RevenueManager</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>B24DealID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ChargingRules</name>
    <attributes>
      <name>ChargingRule</name>
      <type>
        <types>EnumRef.ChargingRuleTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>ChargingRuleValue</name>
      <type>
        <types>CatalogRef.Услуги</types>
        <types>CatalogRef.НаборыУслуг</types>
        <types>CatalogRef.ТипыНомеров</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ChargingFolio</name>
      <type>
        <types>DocumentRef.СчетПроживания</types>
      </type>
    </attributes>
    <attributes>
      <name>ValidFromDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ValidToDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Пансион83/src/Catalogs/ГруппыГостей/Forms/tcListForm/Module.bsl
//--------------------------------------------------------------
&AtServer
Процедура OnCreateAtServer(pCancel, pStandardProcessing)
	vInHouse = False;
	If НЕ Parameters.Property("InHouse", vInHouse) Тогда
		vInHouse = False;
	EndIf;
	FillGGList(vInHouse);
КонецПроцедуры //OnCreateAtServer

//--------------------------------------------------------------
&AtServer
Процедура FillGGList(pInHouse)
	vQry = New Query;
	If pInHouse Тогда
		vQry.Text = 
		"SELECT
		|	Размещение.ГруппаГостей.Code AS Code,
		|	Размещение.ГруппаГостей AS ГруппаГостей,
		|	Размещение.ГруппаГостей.CheckInDate AS CheckInDate,
		|	Размещение.ГруппаГостей.Продолжительность AS Продолжительность,
		|	Размещение.ГруппаГостей.ДатаВыезда AS ДатаВыезда,
		|	Размещение.ГруппаГостей.ЗаездГостей AS ЗаездГостей,
		|	Размещение.ГруппаГостей.Контрагент AS Контрагент,
		|	Размещение.ГруппаГостей.Клиент AS Клиент,
		|	Размещение.ГруппаГостей.Description AS Description,
		|	Размещение.ГруппаГостей.Status AS Status
		|FROM
		|	Document.Размещение AS Размещение
		|WHERE
		|	NOT Размещение.DeletionMark
		|	AND Размещение.Posted
		|	AND Размещение.Гостиница = &qHotel
		|	AND Размещение.ГруппаГостей.Owner = &qHotel
		|	AND Размещение.СтатусРазмещения.IsActive
		|	AND Размещение.СтатусРазмещения.ЭтоГости
		|
		|GROUP BY
		|	Размещение.ГруппаГостей,
		|	Размещение.ГруппаГостей.Code
		|
		|UNION ALL
		|
		|SELECT
		|	Бронирование.ГруппаГостей.Code,
		|	Бронирование.ГруппаГостей,
		|	Бронирование.ГруппаГостей.CheckInDate,
		|	Бронирование.ГруппаГостей.Продолжительность,
		|	Бронирование.ГруппаГостей.ДатаВыезда,
		|	Бронирование.ГруппаГостей.ЗаездГостей,
		|	Бронирование.ГруппаГостей.Контрагент,
		|	Бронирование.ГруппаГостей.Клиент,
		|	Бронирование.ГруппаГостей.Description,
		|	Бронирование.ГруппаГостей.Status
		|FROM
		|	Document.Бронирование AS Бронирование
		|WHERE
		|	Бронирование.Posted
		|	AND NOT Бронирование.DeletionMark
		|	AND Бронирование.Гостиница = &qHotel
		|	AND Бронирование.ГруппаГостей.Owner = &qHotel
		|	AND NOT Бронирование.ГруппаГостей.DeletionMark
		|	AND Бронирование.ReservationStatus.IsActive
		|	AND NOT Бронирование.ReservationStatus.ЭтоЗаезд
		|
		|GROUP BY
		|	Бронирование.ГруппаГостей,
		|	Бронирование.ГруппаГостей.Code";
		vQry.SetParameter("qSkipCheckIn", False);
	Else
		vQry.Text =
		"SELECT
		|	ГруппыГостей.Code AS Code,
		|	ГруппыГостей.Ref AS ГруппаГостей,
		|	ГруппыГостей.CheckInDate,
		|	ГруппыГостей.Продолжительность,
		|	ГруппыГостей.ДатаВыезда,
		|	ГруппыГостей.ЗаездГостей,
		|	ГруппыГостей.Контрагент,
		|	ГруппыГостей.Клиент,
		|	ГруппыГостей.Description,
		|	ГруппыГостей.Status
		|FROM
		|	Catalog.ГруппыГостей AS GuestGroups
		|WHERE
		|	ГруппыГостей.Owner = &qHotel
		|	AND NOT ГруппыГостей.IsFolder
		|	AND NOT ГруппыГостей.DeletionMark";
	EndIf;
	vQry.SetParameter("qHotel", ПараметрыСеанса.ТекущаяГостиница);
	vQryResult = vQry.Execute().Unload();
	vQryResult.GroupBy("Code, ГруппаГостей, CheckInDate, Продолжительность, ДатаВыезда, ЗаездГостей, Контрагент, Клиент, Description, Status");
	vQryResult.Sort("Code");
	ValueToFormAttribute(vQryResult, "List");
КонецПроцедуры //FillGGList

//--------------------------------------------------------------
&НаКлиенте
Процедура ListSelection(pItem, pSelectedRow, pField, pStandardProcessing)
	vCurData = pItem.CurrentData;
	If vCurData <> Неопределено Тогда
		Close(vCurData.ГруппаГостей);
	EndIf;
КонецПроцедуры //ListSelection

//--------------------------------------------------------------
&НаКлиенте
Процедура OnOpen(pCancel)
	// Activate last row
	If List.Count() > 0 Тогда
		Items.List.CurrentRow = List.Get(List.Count()-1).GetID();
	EndIf;
КонецПроцедуры //OnOpen

//--------------------------------------------------------------
&НаКлиенте
Процедура Choose(pCommand)
	vCurData = Items.List.CurrentData;
	If vCurData <> Неопределено Тогда
		Close(vCurData.ГруппаГостей);
	EndIf;
КонецПроцедуры //Choose
